import numpy as np
from sklearn import tree

books = ('《Python程序设计基础（第2版）》','《Python程序设计基础与应用》',
         '《Python程序设计（第2版）》','《大数据的Python基础》',
         '《Python程序设计开发宝典》','《Python可以这样学》',
         '《中学生可以这样学Python》','《Python编程基础与案例集锦（中学版）》',
         '《玩转Python轻松过二级》','微信公众号“Python小屋”的免费资料',)

#0没看过， 1很多看不懂， 2大部分可以看懂， 3没压力
answers = [[3,3,3,3,3,3,3,3,3,3],[0,0,0,0,0,0,0,0,0,0],
           [1,1,1,1,1,1,1,1,1,1],[0,0,0,0,0,0,2,2,0,1],
           [0,0,0,0,3,3,0,0,0,3],[3,3,0,3,0,0,0,0,3,1],
           [3,0,3,0,3,0,0,3,3,2],[0,0,3,0,3,3,0,0,0,3],
           [2,2,0,2,0,0,0,0,0,1],[0,2,1,3,1,1,0,0,2,1]]

labels = ['超级高手','门外汉','初级选手','初级选手','高级选手',
          '中级选手','高级选手','超级选手','初级选手','初级选手']

new_answers = [[1,0,2,1,2,0,0,1,1,2],
               [3,1,3,2,1,0,2,2,3,1],
               [1,3,1,2,3,0,0,0,0,1]]

#训练决策树模型
clf = tree.DecisionTreeClassifier()
clf.fit(answers, labels)

#他们的python水平如何
print(clf.predict(new_answers))





